### Oracle 연동
Oracle DBMS와 연결해서 
SQL 실행 객체 생성 후, SQL 쿼리문을 통헤 relational database 제어

REMEMBER:

-sql정의
기존 SQL과 동일하게 작성하지만, 아래와 같이 value 값이 들어가야하는 부분은
colon을 사용해서 파라미터를 지정한다. (추후 sql실행 시, 이 파라미터 순서대로 인자값을 전달하면됨)
sql='''
    INSERT INTO crawling (no, name, phone, email, rdate)
    VALUES(crawling_seq.nextval, :name, :phone, :email, sysdate)
'''

-cursor.execute(sql,(tuple))
이 tuple안에 sql안의 파라미터에 넣고싶은 인자값들을 넣는다.

-cursor객체로 sql문을 execute한 후, commit해야한다! 
**conn.commit()**
commit해야지만 SQL Developer프로그램을 통해 update된 DB 확인 가능

-cursor객체로 sql문을 execute한 후, **정상**처리 되었다면, result 조회 결과가 **None**이다.
비정상 처리시, result=Exception
(e.g.,)
result = cursor.execute(sql, ('Ed','010-123-1234','email@gmail.com'))
print('result:', result) ==>output: None(정상 처리) or Exception(에러)

-cursor객체로 fetch해오는 방법:
sql문 (fetch해오는것이기때문에 select문)을 정의하고,
cursor.execute(sql) 실행한 후,
rows = cursor.fetchall() : 테이블의 데이터 전체를 list(of rows)형태로 가져온다
또는
row = cursor.fetchone() : 테이블에서 하나의 row를 tuple형태로 가져온다

In [3]:
import cx_Oracle
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

In [5]:
### table 삭제
cursor.execute('DROP TABLE crawling')

In [6]:
### table 생성
cursor.execute('''
CREATE TABLE crawling(
    no NUMBER(7) NOT NULL PRIMARY KEY,
    name VARCHAR(32) NOT NULL,
    phone VARCHAR(32) NOT NULL,
    email VARCHAR(64) NOT NULL,
    rdate DATE NOT NULL
)
''')

In [7]:
### sequence 삭제
cursor.execute('DROP SEQUENCE crawling_seq')

In [8]:
### sequence 생성
cursor.execute('''
CREATE SEQUENCE crawling_seq
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999
    CACHE 2
    NOCYCLE
''')

In [9]:
### insert문
sql='''
    INSERT INTO crawling (no, name, phone, email, rdate)
    VALUES(crawling_seq.nextval, :name, :phone, :email, sysdate)
'''

In [10]:
result = cursor.execute(sql, ('Ed','010-123-1234','email@gmail.com'))
print('result:', result)
## None: 정상 처리, Exception: 에러

result: None

In [11]:
cursor.execute(sql,('Jeremy','010-7564-5646','jem@mail.com'))
cursor.execute(sql,('Superhero','010-8043-1248','pom@mail.com'))
cursor.execute(sql,('Antman','010-8104-2236','joy@mail.com'))

In [13]:
# commit을 해야지만, sql developer에서 table에 insert한 data 확인가능.
conn.commit()

In [14]:
### select문
sql='''
    SELECT no, name, phone, email, rdate
    FROM crawling
    ORDER BY no ASC
'''

In [15]:
cursor.execute(sql)

In [16]:
#모든 record의 산출
rows = cursor.fetchall()

In [19]:
for r in rows:
    print(r)

(1, 'Ed', '010-123-1234', 'email@gmail.com', datetime.datetime(2021, 4, 16, 19, 52, 18))
(2, 'Jeremy', '010-7564-5646', 'jem@mail.com', datetime.datetime(2021, 4, 16, 19, 52, 28))
(3, 'Superhero', '010-8043-1248', 'pom@mail.com', datetime.datetime(2021, 4, 16, 19, 52, 28))
(4, 'Antman', '010-8104-2236', 'joy@mail.com', datetime.datetime(2021, 4, 16, 19, 52, 28))

In [20]:
print(type(rows))

<class 'list'>

In [15]:
print(type(rows[0]))

<class 'tuple'>

In [16]:
for row in rows:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print(fmt.format(row[0], row[1], row[2], row[3], row[4]))

1, Ed, 010-123-1234, email@gmail.com, 2021-04-13 09:23:12
2, Jeremy, 010-7564-5646, jem@mail.com, 2021-04-13 09:24:55
3, Superhero, 010-8043-1248, pom@mail.com, 2021-04-13 09:24:55
4, Antman, 010-8104-2236, joy@mail.com, 2021-04-13 09:24:55

In [17]:
### 조회 
# 한 건의 record 조회

In [21]:
sql='''
    SELECT no, name, phone, email, rdate
    FROM crawling
    WHERE no= :no
'''

In [22]:
cursor.execute(sql,(1,)) 
# (1,): Tuple로 인식하기위해 comma 꼭 표기해야함.
# sql 쿼리문의 내용에 따라서 tuple안에 요소 갯수가 달라진다.
# eg. no로 한건 선택하기위해 tuple에 no 1개만 들어감
# eg. no, name으로 한건 선택이라면, tuple에 no,name 2개 들어간다.

In [23]:
row = cursor.fetchone()
fmt = "{0}, {1}, {2}, {3}, {4}"
print(fmt.format(row[0], row[1], row[2], row[3], row[4]))

1, Ed, 010-123-1234, email@gmail.com, 2021-04-16 19:52:18

In [24]:
type(row)

tuple

In [25]:
# 한건의 레코드 조회, 조건의 추가
sql='''
    SELECT no, name, phone, email, rdate
    FROM crawling
    WHERE no =:no and name =:name
'''

In [26]:
cursor.execute(sql,(2,'Jeremy'))

In [27]:
row = cursor.fetchone() #하나의 레코드 산출

In [28]:
print(type(row))

<class 'tuple'>

In [29]:
if row != None:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print(fmt.format(row[0], row[1], row[2], row[3], row[4]))
else:
    print('일치하는 레코드가 없습니다.')

2, Jeremy, 010-7564-5646, jem@mail.com, 2021-04-16 19:52:28

In [30]:
### 수정
sql='''
    UPDATE crawling
    SET name =:name, phone =:phone, email=:email, rdate=sysdate
    WHERE no=:no
'''

In [31]:
cursor.execute(sql,('Spiderman','111-111-1111','spyder@mail.com',3))

In [32]:
conn.commit()

In [33]:
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no
'''
cursor.execute(sql, (3,))

In [34]:
row = cursor.fetchone()
fmt = "{0}, {1}, {2}, {3}, {4}"
print(fmt.format(row[0], row[1], row[2], row[3], row[4]))

3, Spiderman, 111-111-1111, spyder@mail.com, 2021-04-16 20:17:47

In [35]:
### 삭제
sql = '''
    DELETE FROM crawling
    WHERE no=:no
'''

In [36]:
cursor.execute(sql,(2,))
conn.commit()

In [37]:
cursor = conn.cursor()
sql = '''
    SELECT no, name, phone, email, rdate
    FROM crawling
    ORDER BY no ASC
'''
cursor.execute(sql)

In [38]:
data = cursor.fetchall()
for d in data:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print(fmt.format(d[0], d[1], d[2], d[3], d[4]))

1, Ed, 010-123-1234, email@gmail.com, 2021-04-16 19:52:18
3, Spiderman, 111-111-1111, spyder@mail.com, 2021-04-16 20:17:47
4, Antman, 010-8104-2236, joy@mail.com, 2021-04-16 19:52:28

## pandas와 oracle 데이터 주고받기

Pandas는 하나의 python module로, python언어를 사용해서 data manipulation and analysis를 수행할때에 사용된다.
(Basically, it provides an easy interface to interact with flowing data and apply transformations to them on the go.)

pandas is like the bread and butter for data applications.

The Pandas module has been developed on top of another popular module - Numpy.
Also, data in Pandas can be used to provide other packages like SciPy(for scientific analysis), Matplotlib(for making visualizations), and Scikit-learn(used as a source for machine learning modules)

(more on using Pandas: refer to sqlshack.com

https://www.sqlshack.com/introduction-to-sqlalchemy-in-pandas-dataframe/#:~:text=Pandas%20in%20Python%20uses%20a%20module%20known%20as,and%20running%20with%20the%20dataframe%20object%20in%20pandas.)


### SQLAlchemy

Pandas가 SQLAlchemy module을 사용해서 다양한 database에 연결하고, database operation을 수행할 수 있다.

SQLAlchemy란? ==> 
Python SQL toolkit이고 Object Relational Mapper역할을 수행해준다.

SQLAlchemy is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.
It provides a full suite of well known enterprise-level persistence patterns, designed for efficient and high-performing database access, adapted into a simple and Pythonic domain language.

### cx_Oracle

cx_Oracle is a Python extension module that enables access to Oracle Database

In [1]:
!pip show pandas

Name: pandas
Version: 1.2.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\programdata\anaconda3\envs\pydata\lib\site-packages
Requires: pytz, python-dateutil, numpy
Required-by: seaborn

In [2]:
!pip show cx_oracle

Name: cx-Oracle
Version: 8.1.0
Summary: Python interface to Oracle
Home-page: https://oracle.github.io/python-cx_Oracle
Author: "Anthony Tuininga",
Author-email: "anthony.tuininga@gmail.com",
License: BSD License
Location: c:\programdata\anaconda3\envs\pydata\lib\site-packages
Requires:
Required-by:

In [3]:
!pip show sqlalchemy

Name: SQLAlchemy
Version: 1.4.7
Summary: Database Abstraction Library
Home-page: http://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: c:\programdata\anaconda3\envs\pydata\lib\site-packages
Requires: importlib-metadata, greenlet
Required-by:

In [39]:
# Oracle -> Pandas
import cx_Oracle
import pandas as pd
from sqlalchemy import create_engine

In [40]:
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')

In [41]:
sql='''
    SELECT no, name, phone, email, rdate
    FROM crawling
    ORDER BY no ASC
'''
df = pd.read_sql(sql, conn)

In [42]:
conn.close()

In [43]:
df

   NO       NAME          PHONE            EMAIL               RDATE
0   1         Ed   010-123-1234  email@gmail.com 2021-04-16 19:52:18
1   3  Spiderman   111-111-1111  spyder@mail.com 2021-04-16 20:17:47
2   4     Antman  010-8104-2236     joy@mail.com 2021-04-16 19:52:28

In [44]:
# DataFrame은 컬럼명을 대문자로 저장함으로 대소문자 주의
max_val = max(df['NO'])+1  
max_val

5

In [45]:
# DataFrame에 1명의 주소를 추가할것, 컬럼명 대소문자 구분.
new_row = {'NO':max_val, 'NAME':'사랑이','PHONE':'000-111-1110',
           'EMAIL':'mail@gmail.com','RDATE':'2021-04-13 10:00:00'}
df2 = df.append(new_row, ignore_index = True)
df2

   NO       NAME          PHONE            EMAIL                RDATE
0   1         Ed   010-123-1234  email@gmail.com  2021-04-16 19:52:18
1   3  Spiderman   111-111-1111  spyder@mail.com  2021-04-16 20:17:47
2   4     Antman  010-8104-2236     joy@mail.com  2021-04-16 19:52:28
3   5        사랑이   000-111-1110   mail@gmail.com  2021-04-13 10:00:00

In [46]:
print(type(df))
print(type(df2))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [47]:
# Oracle 테이블 다시 생성해서 update된 데이터를 갖고있는 df2를 Oracle DB에 입력한다.
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

In [48]:
cursor.execute('DROP TABLE crawling')

In [49]:
cursor.execute('''
CREATE TABLE crawling (
  no    NUMBER(7)   NOT NULL PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATE        NOT NULL
)
''')

In [50]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NO      4 non-null      int64
 1   NAME    4 non-null      object
 2   PHONE   4 non-null      object
 3   EMAIL   4 non-null      object
 4   RDATE   4 non-null      object
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes

In [52]:
# Oracle Date 지원 형식으로 변경, 컬럼명 대소문자 구분
# 기존 object에서 date형으로 변환위해
df2['RDATE'] = pd.to_datetime(df2['RDATE']) 
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NO      4 non-null      int64
 1   NAME    4 non-null      object
 2   PHONE   4 non-null      object
 3   EMAIL   4 non-null      object
 4   RDATE   4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 288.0+ bytes

In [53]:
# Pandas -> Oracle 
# pandas에 있는 data를 oracle로 보낸다

engine = create_engine('oracle+cx_oracle://user1234:1234@localhost:1521/?service_name=XE', 
                       echo=False)
df2.to_sql(name='crawling', con=engine, if_exists='append', index=False)

In [29]:
sql='''
    SELECT no, name, phone, email, rdate
    FROM crawling
    ORDER BY no ASC
'''
cursor.execute(sql)

In [25]:
rows = cursor.fetchall()

In [27]:
for row in rows:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print(fmt.format(row[0], row[1], row[2], row[3], row[4]))

3, Spiderman, 111-111-1111, spyder@mail.com, 2021-04-13 09:44:55
4, Antman, 010-8104-2236, joy@mail.com, 2021-04-13 09:24:55
5, 사랑이, 000-111-1110, mail@gmail.com, 2021-04-13 10:00:00

In [34]:
# Oracle -> Pandas
# dataframe으로 oracle data가져오기

conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')

sql='''
    SELECT no, name, phone, email, rdate
    FROM crawling
    ORDER BY no
'''

df3 = pd.read_sql(sql, conn)

conn.close()

In [35]:
df3

   NO       NAME          PHONE            EMAIL               RDATE
0   3  Spiderman   111-111-1111  spyder@mail.com 2021-04-13 09:44:55
1   4     Antman  010-8104-2236     joy@mail.com 2021-04-13 09:24:55
2   5        사랑이   000-111-1110   mail@gmail.com 2021-04-13 10:00:00